app/controllers/users_controller.rb

INSERT INTO "users" ("name", "admin", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "abc"], ["admin", "t"], ["email", "emil@email.com"], ["created_at", "2017-12-04 12:12:10.825139"], ["updated_at", "2017-12-04 12:12:10.825139"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save